Revit 2027 API
CurveLoop.CreateViaThicken(Curve, Double, XYZ) Method
 Creates a new closed curve loop by thickening the input curve with respect to a given plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static CurveLoop CreateViaThicken(
	Curve pCurve,
	double thickness,
	XYZ normal
)
Public Shared Function CreateViaThicken (
	pCurve As Curve,
	thickness As Double,
	normal As XYZ
) As CurveLoop
public:
static CurveLoop^ CreateViaThicken(
	Curve^ pCurve,
	double thickness,
	XYZ^ normal
)
static member CreateViaThicken :
        pCurve : Curve *
        thickness : float *
        normal : XYZ -> CurveLoop
Parameters
pCurve Curve
 The input curve.
thickness Double
 The distance between the offset curves created on either side of the input curve.
normal XYZ
 The normal vector to the plane used for thickening.
Return Value
CurveLoop
 The new curve loop.
Exceptions
Exception | Condition
ArgumentException |  The input thickness is too short for a curve. -or- The input pCurve points to a helical curve and is not supported for this operation.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Throws if the input curve could not be thickened.
Remarks
 The new loop will be created via offsets of the input curve (in the plane of the normal vector) with the endpoints connected with lines.The original curve will be at the center of the new loop.
Note that for input elliptical fragments and NurbSpline curves, any offsets will be created as HermiteSplines.
See Also
Reference
CurveLoop Class
CreateViaThicken Overload
Autodesk.Revit.DB Namespace